#                                        Data Cleaning Project 
### This is a sampe dataset which consists of age of getting married. The Dataset also consists of different variables like gender, height, religion, mother tongue, profession, location etc. The data is not in proper order to perform data analysis. Therefore, the data cleaning process is needed to do Data Analysis and perform different statistical operations.

In [4]:
import numpy as np
import pandas as pd
from collections import Counter
from numpy import NaN 

import warnings 
warnings.filterwarnings('ignore')

In [5]:
# importing data
agemrg = pd.read_csv('age_of_marriage_data.csv')

In [6]:
agemrg.head()

,id,gender,height,religion,caste,mother_tongue,profession,location,country,age_of_marriage
0,1,female,"5'4""",NaN,others,Telugu,NaN,London,United Kingdom,21.0
1,2,male,"5'7""",Jain,Shwetamber,Gujarati,Doctor / Healthcare Professional,Fairfax- VA,USA,32.0
2,3,male,"5'7""",Hindu,Brahmin,Hindi,Entrepreneurs / Business,Begusarai,India,32.0
3,4,female,"5'0""",Hindu,Thakur,Hindi,Architect,Mumbai,India,30.0
4,5,male,"5'5""",Christian,Born Again,Malayalam,Sales Professional / Marketing,Sulthan Bathery,India,30.0

In [7]:
agemrg.tail()

,id,gender,height,religion,caste,mother_tongue,profession,location,country,age_of_marriage
2562,2563,female,"5'3""",Hindu,Thakur,Hindi,Banking Professional,Agra,India,27.0
2563,2564,male,"5'11""",Hindu,Thakur,Hindi,Software Professional,Ottawa,Canada,31.0
2564,2565,female,"5'3""",Hindu,Baishya,Bengali,Software Consultant,Bengaluru / Bangalore,India,28.0
2565,2566,female,"4'11""",NaN,others,Telugu,Not working,Hyderabad,India,26.0
2566,2567,female,"5'2""",Christian,Marthoma,Malayalam,Software Professional,Pune,India,32.0

In [8]:
agemrg.describe()

                id  age_of_marriage
count  2567.000000      2548.000000
mean   1284.000000        29.648352
std     741.173394         2.802414
min       1.000000        20.000000
25%     642.500000        28.000000
50%    1284.000000        30.000000
75%    1925.500000        32.000000
max    2567.000000        36.000000

In [9]:
agemrg.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2567 entries, 0 to 2566
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   id               2567 non-null   int64
 1   gender           2538 non-null   object
 2   height           2449 non-null   object
 3   religion         1932 non-null   object
 4   caste            2425 non-null   object
 5   mother_tongue    2403 non-null   object
 6   profession       2237 non-null   object
 7   location         2412 non-null   object
 8   country          2551 non-null   object
 9   age_of_marriage  2548 non-null   float64
dtypes: float64(1), int64(1), object(8)
memory usage: 200.7+ KB

#### Before moving with filling of missing data we need to first convert some features which are objects into int64 type. 
#### Let's say we have height in the dataset. The column has a data type of object. This column needs to be converted into int datatype 
#### so that it can be useful in the further operations.
#### 1 foot = 30.48 cm
#### 1 inch = 2.48 cm

# Age of Marriage

In [10]:
agemrg[('height')].count()

2449

In [11]:
agemrg['age_of_marriage'].value_counts()

30.0    415
29.0    373
31.0    311
28.0    308
32.0    246
27.0    217
33.0    183
26.0    114
34.0    107
35.0     91
25.0     60
24.0     50
21.0     19
22.0     18
23.0     16
36.0     12
20.0      8
Name: age_of_marriage, dtype: int64

In [12]:
age_null = agemrg['age_of_marriage'].isnull().sum()

In [13]:
age_null

19

In [14]:
avg_age = agemrg['age_of_marriage'].mean()

In [15]:
age_null_1 = agemrg[agemrg['age_of_marriage'].isnull()].index.tolist()

In [16]:
agemrg['age_of_marriage'].iloc[age_null_1] = avg_age

In [17]:
agemrg.isnull().sum()

id                   0
gender              29
height             118
religion           635
caste              142
mother_tongue      164
profession         330
location           155
country             16
age_of_marriage      0
dtype: int64

In [18]:
avg_gen = agemrg['gender'].unique()

In [19]:
avg_gen

array(['female', 'male', nan], dtype=object)

In [20]:
Counter(agemrg['gender'])

Counter({'female': 1200, 'male': 1338, nan: 29})

In [21]:
un_ctr = agemrg['country'].unique()

In [22]:
un_ctr

array([' United Kingdom', ' USA', ' India', ' Australia',
       ' United Arab Emirates', ' Canada', ' Malaysia', nan,
       ' Netherlands', ' Sweden', ' Qatar', ' Pakistan', ' Denmark',
       ' New Zealand', ' Myanmar', ' Hong Kong SAR', ' Bangladesh',
       ' Italy', ' Kuwait', ' Japan', ' Bahrain', ' Nigeria', ' Ireland',
       ' Singapore', ' Armenia', ' Oman', ' Philippines', ' Norway',
       ' Germany', ' South Africa'], dtype=object)

In [23]:
agemrg.isnull().sum()

id                   0
gender              29
height             118
religion           635
caste              142
mother_tongue      164
profession         330
location           155
country             16
age_of_marriage      0
dtype: int64

In [24]:
agemrg['gender'].value_counts()

male      1338
female    1200
Name: gender, dtype: int64

#### In gender we have to fill NaN values according to the height of the person. Usually Females average height is less as compared to the average height of Males. We have to fill the Null valeus according to the gender. To fill the Null values, we will calculate the average height of males and average height of females. Then accordingly we will fill the Null values of gender.

In [25]:
agemrg['height_feet'] = agemrg['height'].dropna().apply(lambda x: str(x).split("'")[0])

In [26]:
agemrg['height_inches'] = agemrg['height'].dropna().apply(lambda x: str(x).split("'")[-1][0:-1])

In [27]:
agemrg[['height', 'height_feet', 'height_inches']]

     height height_feet height_inches
0      5'4"           5             4
1      5'7"           5             7
2      5'7"           5             7
3      5'0"           5             0
4      5'5"           5             5
...     ...         ...           ...
2562   5'3"           5             3
2563  5'11"           5            11
2564   5'3"           5             3
2565  4'11"           4            11
2566   5'2"           5             2

[2567 rows x 3 columns]

In [28]:
agemrg.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2567 entries, 0 to 2566
Data columns (total 12 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   id               2567 non-null   int64
 1   gender           2538 non-null   object
 2   height           2449 non-null   object
 3   religion         1932 non-null   object
 4   caste            2425 non-null   object
 5   mother_tongue    2403 non-null   object
 6   profession       2237 non-null   object
 7   location         2412 non-null   object
 8   country          2551 non-null   object
 9   age_of_marriage  2567 non-null   float64
 10  height_feet      2449 non-null   object
 11  height_inches    2449 non-null   object
dtypes: float64(1), int64(1), object(10)
memory usage: 240.8+ KB

In [29]:
agemrg['height_feet'] = agemrg['height_feet'].astype(float)

In [30]:
agemrg['height_feet'] = agemrg['height_feet'].astype('Int64')

In [31]:
agemrg['height_inches'] = agemrg['height_inches'].astype(float)

In [32]:
agemrg['height_inches'] = agemrg['height_inches'].astype('Int64')

In [33]:
agemrg.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2567 entries, 0 to 2566
Data columns (total 12 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   id               2567 non-null   int64
 1   gender           2538 non-null   object
 2   height           2449 non-null   object
 3   religion         1932 non-null   object
 4   caste            2425 non-null   object
 5   mother_tongue    2403 non-null   object
 6   profession       2237 non-null   object
 7   location         2412 non-null   object
 8   country          2551 non-null   object
 9   age_of_marriage  2567 non-null   float64
 10  height_feet      2449 non-null   Int64
 11  height_inches    2449 non-null   Int64
dtypes: Int64(2), float64(1), int64(1), object(8)
memory usage: 245.8+ KB

In [34]:
agemrg['height_cms'] = (agemrg['height_feet'] * 30.48) + (agemrg['height_inches'] * 2.48)

In [35]:
agemrg.head()

,id,gender,height,religion,caste,mother_tongue,profession,location,country,age_of_marriage,height_feet,height_inches,height_cms
0,1,female,"5'4""",NaN,others,Telugu,NaN,London,United Kingdom,21.0,5,4,162.32
1,2,male,"5'7""",Jain,Shwetamber,Gujarati,Doctor / Healthcare Professional,Fairfax- VA,USA,32.0,5,7,169.76
2,3,male,"5'7""",Hindu,Brahmin,Hindi,Entrepreneurs / Business,Begusarai,India,32.0,5,7,169.76
3,4,female,"5'0""",Hindu,Thakur,Hindi,Architect,Mumbai,India,30.0,5,0,152.4
4,5,male,"5'5""",Christian,Born Again,Malayalam,Sales Professional / Marketing,Sulthan Bathery,India,30.0,5,5,164.8

In [36]:
agemrg.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2567 entries, 0 to 2566
Data columns (total 13 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   id               2567 non-null   int64
 1   gender           2538 non-null   object
 2   height           2449 non-null   object
 3   religion         1932 non-null   object
 4   caste            2425 non-null   object
 5   mother_tongue    2403 non-null   object
 6   profession       2237 non-null   object
 7   location         2412 non-null   object
 8   country          2551 non-null   object
 9   age_of_marriage  2567 non-null   float64
 10  height_feet      2449 non-null   Int64
 11  height_inches    2449 non-null   Int64
 12  height_cms       2449 non-null   Float64
dtypes: Float64(1), Int64(2), float64(1), int64(1), object(8)
memory usage: 268.4+ KB

In [37]:
agemrg.isnull().sum()

id                   0
gender              29
height             118
religion           635
caste              142
mother_tongue      164
profession         330
location           155
country             16
age_of_marriage      0
height_feet        118
height_inches      118
height_cms         118
dtype: int64

In [38]:
agemrg['height_cms'].mean()

164.04429563086984

In [39]:
agemrg['height_cms'].mode()

0    159.84
1    167.28
dtype: Float64

In [40]:
agemrg['height_cms'].median()

164.8

In [41]:
#def null_imputer(data):
    #data_mean = data.mean()
    #return data_mean
    #data_null = data.isnull().index.tolist()
    #data.iloc[data_null] = data_mean

In [42]:
agemrg.head()

,id,gender,height,religion,caste,mother_tongue,profession,location,country,age_of_marriage,height_feet,height_inches,height_cms
0,1,female,"5'4""",NaN,others,Telugu,NaN,London,United Kingdom,21.0,5,4,162.32
1,2,male,"5'7""",Jain,Shwetamber,Gujarati,Doctor / Healthcare Professional,Fairfax- VA,USA,32.0,5,7,169.76
2,3,male,"5'7""",Hindu,Brahmin,Hindi,Entrepreneurs / Business,Begusarai,India,32.0,5,7,169.76
3,4,female,"5'0""",Hindu,Thakur,Hindi,Architect,Mumbai,India,30.0,5,0,152.4
4,5,male,"5'5""",Christian,Born Again,Malayalam,Sales Professional / Marketing,Sulthan Bathery,India,30.0,5,5,164.8

### We dont need height column now, so we intent to drop it.

In [44]:
agemrg.iloc[3:5, 3] #iloc[row:column]

3        Hindu
4    Christian
Name: religion, dtype: object

### dropping mother tongue, country, height, id, height_feet, height_inches

In [46]:
new_agemrg = agemrg.drop(['height','mother_tongue','country','id','height_feet','height_inches'], axis=1)

In [47]:
new_agemrg

,gender,religion,caste,profession,location,age_of_marriage,height_cms
0,female,NaN,others,NaN,London,21.0,162.32
1,male,Jain,Shwetamber,Doctor / Healthcare Professional,Fairfax- VA,32.0,169.76
2,male,Hindu,Brahmin,Entrepreneurs / Business,Begusarai,32.0,169.76
3,female,Hindu,Thakur,Architect,Mumbai,30.0,152.4
4,male,Christian,Born Again,Sales Professional / Marketing,Sulthan Bathery,30.0,164.8
...,...,...,...,...,...,...,...
2562,female,Hindu,Thakur,Banking Professional,Agra,27.0,159.84
2563,male,Hindu,Thakur,Software Professional,Ottawa,31.0,179.68
2564,female,Hindu,Baishya,Software Consultant,Bengaluru / Bangalore,28.0,159.84
2565,female,NaN,others,Not working,Hyderabad,26.0,149.2
2566,female,Christian,Marthoma,Software Professional,Pune,32.0,157.36

In [48]:
new_agemrg.isnull().sum()

gender              29
religion           635
caste              142
profession         330
location           155
age_of_marriage      0
height_cms         118
dtype: int64

In [49]:
new_agemrg['height_cms'].mean()

164.04429563086984

In [50]:
new_agemrg[['height_cms','gender']]

      height_cms  gender
0         162.32  female
1         169.76    male
2         169.76    male
3          152.4  female
4          164.8    male
...          ...     ...
2562      159.84  female
2563      179.68    male
2564      159.84  female
2565       149.2  female
2566      157.36  female

[2567 rows x 2 columns]

In [51]:
new_agemrg.groupby('gender').mean()

        age_of_marriage  height_cms
gender
female        29.158736  158.427814
male          30.173270  169.247287

In [52]:
new_agemrg['gender'].value_counts()

male      1338
female    1200
Name: gender, dtype: int64

In [53]:
new_agemrg['height_cms'] = new_agemrg['height_cms'].fillna(new_agemrg.groupby('gender')['height_cms'].transform('mean'))

In [54]:
height_null = new_agemrg[new_agemrg['height_cms'].isnull()].index.tolist()

In [55]:
new_agemrg['height_cms'].iloc[height_null] = 162.85

In [56]:
new_agemrg['religion'].value_counts()

Hindu        1576
Sikh          150
Christian     120
Jain           46
Muslim         40
Name: religion, dtype: int64

In [57]:
new_agemrg['caste'].value_counts()

others                   493
 Brahmin                 252
 Kshatriya                70
 Lingayath                65
 Agarwal                  53
 Shwetamber               46
 Patel                    42
 Baniya                   41
 Bhandari                 41
 Arora                    41
 Vaishnav                 41
 Khatri                   40
 Scheduled Caste (SC)     40
 Thakur                   40
 Ramdasia                 40
 Valmiki                  40
 OBC - Barber/Naayee      40
 Sindhi-Sakkhar           40
 Goud                     40
 Balija                   40
 Kayastha                 40
 Gursikh                  40
 Arya Vysya               40
 Viswabrahmin             40
 Baidya                   40
 Kaibarta                 40
 Baishnab                 40
 Bhatia                   40
 Billava                  40
 Vanniyar                 40
 Agri                     40
 Marthoma                 40
 Ahom                     40
 Roman Catholic           40
 Rajput - Lodhi           40
 Born Again               40
 Kalita                   40
 Sahu                     40
 Baishya                  40
 Memon                    40
 Panchal                  40
 Saini                    40
Name: caste, dtype: int64

In [71]:
new_agemrg = new_agemrg.dropna(subset=['gender'])

In [70]:
new_agemrg.isnull().sum()

gender               0
religion           606
caste              142
profession         316
location           153
age_of_marriage      0
height_cms           0
dtype: int64

### Here, we can see that the there are two columns which are Caste and Religion. So, if we know the caste of the person, then we can also know about his caste. Mostly in marriages people tend to look at the caste of the Bride or Groom, rather than religion because of the above reason. So we can drop the Religion columns and move ahead with caste column.

In [72]:
new_agemrg = new_agemrg.drop(['religion'], axis=1)

In [75]:
new_agemrg.head()

,gender,caste,profession,location,age_of_marriage,height_cms
0,female,others,NaN,London,21.0,162.32
1,male,Shwetamber,Doctor / Healthcare Professional,Fairfax- VA,32.0,169.76
2,male,Brahmin,Entrepreneurs / Business,Begusarai,32.0,169.76
3,female,Thakur,Architect,Mumbai,30.0,152.4
4,male,Born Again,Sales Professional / Marketing,Sulthan Bathery,30.0,164.8

In [76]:
# filling NaN values in Location column with 'Unknown'

new_agemrg['location'] = new_agemrg['location'].fillna('Unknown')

In [79]:
# fillling NaN values in Caste column with 'others'

new_agemrg['caste'] = new_agemrg['caste'].fillna('others')

In [83]:
new_agemrg['profession'].value_counts()

Not Specified                   263
Not working                     252
Banking Professional            107
Software Professional           105
Entrepreneurs / Business         85
                               ...
Hairstylist                       1
Indian Police Services [IPS]      1
Journalist                        1
IAS / IRS / IES / IFS             1
Pilot / Co-Pilot                  1
Name: profession, Length: 86, dtype: int64

In [85]:
# fillling NaN values in Profession column with 'Not Specified'

new_agemrg['profession'] = new_agemrg['profession'].fillna('Not Specified')

In [86]:
new_agemrg.isnull().sum()

gender             0
caste              0
profession         0
location           0
age_of_marriage    0
height_cms         0
dtype: int64